In [1]:
import  pandas as pd

In [2]:
df = pd.DataFrame({'A' : [1,2,3,4], 'B':['a', 'b', 'c', 'd'], 'C':[4,5,6,7]})
df

   A  B  C
0  1  a  4
1  2  b  5
2  3  c  6
3  4  d  7

#### directly add new col

##### way-1 ------- using list

In [3]:
df['new_col1'] = [1.2,2.3,3.4,4.5]
df

   A  B  C  new_col1
0  1  a  4       1.2
1  2  b  5       2.3
2  3  c  6       3.4
3  4  d  7       4.5

##### way-2  ------ using existing col

In [4]:
df['new_col1'] = df['A'] * 2 + df['C'] * 2
df

   A  B  C  new_col1
0  1  a  4        10
1  2  b  5        14
2  3  c  6        18
3  4  d  7        22

##### using constant value

In [5]:
df['new_col2'] = 'Unknown'
df

   A  B  C  new_col1 new_col2
0  1  a  4        10  Unknown
1  2  b  5        14  Unknown
2  3  c  6        18  Unknown
3  4  d  7        22  Unknown

### ---------------------------------------------------------------------------------------------------------------------------

#### Assign and Apply

### ---------------------------------------------------------------------------------------------------------------------------

#### Insert

In [6]:
df.insert(loc=5, column='new_col3', value = df['A']*2)      # value can be list, derived from other col or a constant 
df

   A  B  C  new_col1 new_col2  new_col3
0  1  a  4        10  Unknown         2
1  2  b  5        14  Unknown         4
2  3  c  6        18  Unknown         6
3  4  d  7        22  Unknown         8

In [7]:
# df.insert(loc, column, value, allow_duplicates)
# allow_duplicates = If set to True, it allows the insertion of a new column with a label that already exists in the df.
# If False and a duplicate label is provided, a ValueError will be raised.

### ---------------------------------------------------------------------------------------------------------------------------

#### loc

In [8]:
df.loc[:, 'new_col'] = df['A']*2                      # can provide list, a constant or  derive from other col
df

   A  B  C  new_col1 new_col2  new_col3  new_col
0  1  a  4        10  Unknown         2        2
1  2  b  5        14  Unknown         4        4
2  3  c  6        18  Unknown         6        6
3  4  d  7        22  Unknown         8        8